LeeXingyu/GAS_master/STM32Lib/UserLib/device/src/ChordTone.c
/************************************版权所有(c)****************************************
* 版权所有(c), 2012-2013, XXXXXXXX公司, 保留所有权
* 文件名      ：ChordTone.c
* 作者        ：XXXXXX
* 电子邮箱    ：XXXXXX
* 版本        ：V1.0.0.0
* 日期        ：2017-10-07
* 功能描述    ：
* 备注        ：
* 主要函数列表：
* 修改记录    ：
  日      期          版本          修改人          修改内容
  2017-10-07          1.0           XXXXXXXX        创建文件	
****************************************************************************************/

/* 调试部分开关 -----------------------------------------------------------------------*/

/* 包含文件 ---------------------------------------------------------------------------*/
#include "ChordTone.h"
#include "STM32Fxxx_Misc.h"

#include <string.h>

/* 宏定义 -----------------------------------------------------------------------------*/
#define BUZZER_STATE_START				(0x00)
#define BUZZER_STATE_RUN				(0x01)
#define BUZZER_STATE_IDLE				(0x02)


#define BUZZER_SINGLE_FREQ              2700
#define BUZZER_SINGLE_OS_TIME           50
#define BUZZER_SINGLE_PWR_TIME          70

#define BUZZER_SINGLE_OFF_OS_TIME       100
#define BUZZER_SINGLE_OFF_PWR_TIME      100

#define BUZZER_SINGLE_OFF_FREQ          10


#define BUZZER_LONG_SINGLE_FREQ         2700  //这里是报警音配置，尽量只修改这个参数（BUZZER_LONG_SINGLE_FREQ），只能修改后面在数字
#define BUZZER_LONG_SINGLE_LAST_FREQ    3400
#define BUZZER_LONG_SINGLE_OS_TIME      26
#define BUZZER_LONG_SINGLE_PWR_TIME     60
#define BUZZER_LONG_SINGLE_LAST_OS_TIME      28
#define BUZZER_LONG_SINGLE_LAST_PWR_TIME     50

#define BUZZER_LONG_SINGLE_OFF_FREQ     10
#define BUZZER_LONG_SINGLE_OFF_OS_TIME  20
#define BUZZER_LONG_SINGLE_OFF_PWR_TIME 20


/* 结构类型定义 -----------------------------------------------------------------------*/

/* 原型声明部分 -----------------------------------------------------------------------*/

/* 全局变量声明 -----------------------------------------------------------------------*/

/* 静态变量定义 -----------------------------------------------------------------------*/
static uint8		ucBuzzerState = BUZZER_STATE_IDLE;
static ChordTone_t	*p_tChordTone = NULL;

static const ChordTone_t a_tChordTone_1_SingleSong[] =		//单音
{
	{BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
	{0, 0, 0},
};
static const ChordTone_t a_tChordTone_2_SingleSong[] =
{
	{BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
	{0, 0, 0},
};
static const ChordTone_t a_tChordTone_3_SingleSong[] =
{
	{BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
	{0, 0, 0},
};
static const ChordTone_t a_tChordTone_4_SingleSong[] =
{
	{BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
	{0, 0, 0},
};
static const ChordTone_t a_tChordTone_5_SingleSong[] =
{
	{BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
	{0, 0, 0},
};
static const ChordTone_t a_tChordTone_6_SingleSong[] =
{
	{BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
	{0, 0, 0},
};
static const ChordTone_t a_tChordTone_7_SingleSong[] =
{
	{BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
	{0, 0, 0},
};
static const ChordTone_t a_tChordTone_8_SingleSong[] =
{
	{BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
	{0, 0, 0},
};
