LeeXingyu/GAS_master/STM32Lib/UserLib/device/src/ChordTone.c
static const ChordTone_t a_tChordTone_9_SingleSong[] =
{
	{BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
	{0, 0, 0},
};
static const ChordTone_t a_tChordTone_10_SingleSong[] =
{
	{BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
	{0, 0, 0},
};
static const ChordTone_t a_tChordTone_11_SingleSong[] =
{
	{BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
    {BUZZER_SINGLE_OFF_FREQ, BUZZER_SINGLE_OFF_OS_TIME, BUZZER_SINGLE_OFF_PWR_TIME},
    {BUZZER_SINGLE_FREQ, BUZZER_SINGLE_OS_TIME, BUZZER_SINGLE_PWR_TIME},
	{0, 0, 0},
};

static const ChordTone_t a_tChordTone_LongSingleSong[] =	//长单音
{
	//{2600, 2000, 2000},
	//{0, 0, 0},

	{BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
//    {BUZZER_LONG_SINGLE_FREQ, BUZZER_LONG_SINGLE_OS_TIME, BUZZER_LONG_SINGLE_PWR_TIME},
//	{BUZZER_LONG_SINGLE_OFF_FREQ, BUZZER_LONG_SINGLE_OFF_OS_TIME, BUZZER_LONG_SINGLE_OFF_PWR_TIME},
	
    
	{BUZZER_LONG_SINGLE_LAST_FREQ, BUZZER_LONG_SINGLE_LAST_OS_TIME, BUZZER_LONG_SINGLE_LAST_PWR_TIME},
    
    
