LeeXingyu/GAS_master/STM32Lib/UserLib/device/src/ChordTone.c
//	{2600, 100, 20},
//	{10, 100, 20},
//	{2600, 100, 20},
//	{10, 100, 20},
//	{2600, 100, 20},
//	{10, 100, 20},
//	{2600, 100, 20},
//	{10, 100, 20},
//    {2600, 100, 20},
//	{10, 100, 20},
	{0, 0, 0},
};

//static const ChordTone_t a_tChordTone_OffSong[] =			//off
//{
//	{0, 0, 0},
//};

static const ChordTone_t a_tChordTone_PwrOnSong[] =			//1
{
	{600, 20, 20},
	{900, 10, 20},
	{1200, 40, 60},        //{2900, 210, 10},
	{0, 0, 0},
};
static const ChordTone_t a_tChordTone_PwrOffSong[] =		//2
{
	{300, 20, 20},
  {600, 10, 20},
	{1000, 40, 60},        //{2300, 210, 10},
	{0, 0, 0},
};

static const ChordTone_t a_tChordTone_Song2[] =				//3
{
	{100, 20, 20},
	{400, 10, 20},
	{700, 40, 60},        //{2300, 210, 10},
	{0, 0, 0},
};

static const ChordTone_t a_tChordTone_Song1[] =				//4
{
  {1000, 20, 20},
	{800, 20, 30},
	{200, 50, 80},        //{2900, 210, 10},
	{0, 0, 0},
};

static const ChordTone_t a_tChordTone_Song3[] =				//关机和弦音
{
	//{4000, 20, 20},
	//{3200, 20, 20},
	//{2000, 40, 10},        //{2300, 210, 10},
	//{0, 0, 0},

	{1200, 10, 10},		    //1
	{1200, 10, 10},			//2
{400, 10, 10},			//3

	{1200, 10, 10},			//4	稍有停顿
	{0, 0, 0},
};

static const ChordTone_t a_tChordTone_Song4[] =				//关闭气阀门和弦音
{
	//{4000, 20, 20},
	//{3200, 20, 20},
	//{2000, 40, 10},        //{2300, 210, 10},
	//{0, 0, 0},

	{200, 10, 10},		    //1
	{2500, 30, 10},			//2
//  {100, 10, 10},
	{0, 0, 0},
};

static const ChordTone_t a_tChordTone_TwoTigerSong[] =		//两只老虎和弦音
{
	{2000, 25, 25},			//1
	{2300, 25, 25},		    //2
	{2600, 25, 25},			//3
	{2000, 25, 25},			//1
	{2000, 25, 25},			//1
	{2300, 25, 25},			//2
	{2600, 25, 25},			//3
	{2000, 25, 25},		    //1
	{2300, 25, 25},			//2
	{2600, 25, 25},			//3

	{2900, 50, 25},			//4	稍有停顿
	{2300, 25, 25},			//2
	{2600, 25, 25},			//3
	{2900, 75, 25},		//4	和弦效果    {2900, 100, 25},
	{0, 0, 0},
};

static BOOL bChordTone_Running = FALSE;

/****************************************************************************************
* 函数名称：ChordTone_CtrlService()
* 功能描述: 
* 入口参数：
* 返回值  ：
* 其它    ：
* 生成时间：2017-10-07 15:43
****************************************************************************************/
void ChordTone_CtrlService(void)
{
	static ChordTone_t	tTone;
	static uint32		uiChordTone_RunDly = 0;

	if (BSP_OS_Timeout(uiChordTone_RunDly, 10))
		uiChordTone_RunDly = BSP_OS_TimeGet();
	else
		return;

	switch (ucBuzzerState)
	{
		case BUZZER_STATE_START:
		{
			memcpy((char *)&tTone, (char *)p_tChordTone, sizeof(ChordTone_t));

			if (tTone.uiPWRTime)
			{
				tTone.uiPWRTime--;
				Buzzer_PwrOn();
			}
			else
			{
				ucBuzzerState = BUZZER_STATE_IDLE;
				break;
			}

			if (tTone.uiOSCTime)
			{
				tTone.uiOSCTime--;
				ChordTone_PWMEnable(tTone.uiFreq);
			}
			else
			{
				Buzzer_PwrOff();
				ucBuzzerState = BUZZER_STATE_IDLE;
				break;
			}

			ucBuzzerState = BUZZER_STATE_RUN;
		}
		break;

		case BUZZER_STATE_RUN:
		{
			if (tTone.uiPWRTime)
				tTone.uiPWRTime--;
			else
				Buzzer_PwrOff();

			if (tTone.uiOSCTime)
				tTone.uiOSCTime--;
			else
			{
				ChordTone_PWMDisable();
				p_tChordTone++;
				ucBuzzerState = BUZZER_STATE_START;
			}
		}
		break;

		case BUZZER_STATE_IDLE:	
        {
            Buzzer_PwrOff();
			      ChordTone_PWMDisable();
            bChordTone_Running = FALSE; 
        }
        break;
	}
	
}
/****************************************************************************************
* 函数名称：ChordTone_Start()
* 功能描述: 
* 入口参数：
* 返回值  ：
* 其它    ：
* 生成时间：2017-10-07 15:43
****************************************************************************************/
void ChordTone_Start(ChordTone_Music_e eMusic)
{
	BOOL ret = TRUE;

    if (bChordTone_Running)
    {
        if (eCHORD_TONE_MUSIC_OFF == eMusic)
            bChordTone_Running = FALSE;
        else
            return;
    }
    else
        bChordTone_Running = TRUE;
    
	switch (eMusic)
	{
	    	case eCHORD_TONE_MUSIC_1_SINGLE		: p_tChordTone = (ChordTone_t *)a_tChordTone_1_SingleSong;	break;
        case eCHORD_TONE_MUSIC_2_SINGLE     : p_tChordTone = (ChordTone_t *)a_tChordTone_2_SingleSong;	break;
        case eCHORD_TONE_MUSIC_3_SINGLE     : p_tChordTone = (ChordTone_t *)a_tChordTone_3_SingleSong;	break;
        case eCHORD_TONE_MUSIC_4_SINGLE     : p_tChordTone = (ChordTone_t *)a_tChordTone_4_SingleSong;	break;
        case eCHORD_TONE_MUSIC_5_SINGLE     : p_tChordTone = (ChordTone_t *)a_tChordTone_5_SingleSong;	break;
        case eCHORD_TONE_MUSIC_6_SINGLE     : p_tChordTone = (ChordTone_t *)a_tChordTone_6_SingleSong;	break;
        case eCHORD_TONE_MUSIC_7_SINGLE     : p_tChordTone = (ChordTone_t *)a_tChordTone_7_SingleSong;	break;
        case eCHORD_TONE_MUSIC_8_SINGLE     : p_tChordTone = (ChordTone_t *)a_tChordTone_8_SingleSong;	break;
        case eCHORD_TONE_MUSIC_9_SINGLE     : p_tChordTone = (ChordTone_t *)a_tChordTone_9_SingleSong;	break;
        case eCHORD_TONE_MUSIC_10_SINGLE    : p_tChordTone = (ChordTone_t *)a_tChordTone_10_SingleSong;	break;
        case eCHORD_TONE_MUSIC_11_SINGLE    : p_tChordTone = (ChordTone_t *)a_tChordTone_11_SingleSong;	break;
        
        
				case eCHORD_TONE_MUSIC_LONG_SINGLE	: p_tChordTone = (ChordTone_t *)a_tChordTone_LongSingleSong;break;
				case eCHORD_TONE_MUSIC_OFF			: //p_tChordTone = (ChordTone_t *)a_tChordTone_OffSong;		break;
				{
					ret = FALSE;

					p_tChordTone = NULL;

					Buzzer_PwrOff();
					ChordTone_PWMDisable();

					ucBuzzerState = BUZZER_STATE_IDLE;
				}
				break;
		  	case eCHORD_TONE_MUSIC_PWR_ON		: p_tChordTone = (ChordTone_t *)a_tChordTone_PwrOnSong;	    break;
			  case eCHORD_TONE_MUSIC_PWR_OFF		: p_tChordTone = (ChordTone_t *)a_tChordTone_PwrOffSong;	break;
		  	case eCHORD_TONE_MUSIC_TWO_TIGER	: p_tChordTone = (ChordTone_t *)a_tChordTone_TwoTigerSong;	break;
			  case eCHORD_TONE_MUSIC_SONG1		: p_tChordTone = (ChordTone_t *)a_tChordTone_Song1;			break;
				case eCHORD_TONE_MUSIC_SONG2		: p_tChordTone = (ChordTone_t *)a_tChordTone_Song2;			break;
				case eCHORD_TONE_MUSIC_SONG3		: p_tChordTone = (ChordTone_t *)a_tChordTone_Song3;			break;
        //关闭指令语音
				case eCHORD_TONE_MUSIC_SONG4		: p_tChordTone = (ChordTone_t *)a_tChordTone_Song4;			break;
				default                             : p_tChordTone = (ChordTone_t *)a_tChordTone_1_SingleSong;  break;
	}

	if (ret)
		ucBuzzerState = BUZZER_STATE_START;
}

/****************************************************************************************
* 函数名称：ChordTone_Init()
* 功能描述: 
* 入口参数：
* 返回值  ：
* 其它    ：
* 生成时间：2017-10-07 15:43
****************************************************************************************/
void ChordTone_Init(void)
{
	Buzzer_GPIOInit();
	ChordTone_PWMDevInit();
    //ChordTone_PWMEnable(100);

	Buzzer_PwrOff();
}


/****************************************************************************************
* 函数名称：ChordTone_GasClosevoice()
* 功能描述: 气阀关闭按键声音函数
* 入口参数：
* 返回值  ：
* 其它    ：
* 生成时间：2017-10-07 15:43
****************************************************************************************/
void ChordTone_GasClosevoice(ChordTone_Music_e eMusic)
{
  static ChordTone_t	tTone;
  static uint32		uiChordTone_RunDly = 0;
	
    if (bChordTone_Running)
    {
        if (eCHORD_TONE_MUSIC_OFF == eMusic)
            bChordTone_Running = FALSE;
        else
            return;
    }
    else
        bChordTone_Running = TRUE;
  p_tChordTone = (ChordTone_t *)a_tChordTone_Song4;

BUZZER_STATE:		
			memcpy((char *)&tTone, (char *)p_tChordTone, sizeof(ChordTone_t));
		  tTone.uiPWRTime = tTone.uiPWRTime * 40000;
		  tTone.uiOSCTime = tTone.uiOSCTime * 40000;
			Buzzer_PwrOn();
			ChordTone_PWMEnable(tTone.uiFreq);
			while(tTone.uiPWRTime != 0 && tTone.uiOSCTime != 0)
			{	
				if (tTone.uiPWRTime)
					tTone.uiPWRTime--;
				else
					Buzzer_PwrOff();

				if (tTone.uiOSCTime)
					tTone.uiOSCTime--;
				else
				{
					ChordTone_PWMDisable();
					p_tChordTone++;
					goto BUZZER_STATE;
				}
			}
			Buzzer_PwrOff();
			ChordTone_PWMDisable();
			bChordTone_Running = FALSE; 
}

/*******************************版权所有(c)**************END OF FILE********************/
